//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2008, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//**********************************************************************
//<AMI_FHDR_START>
//----------------------------------------------------------------------------
//
// Name:	ATACTRL.UNI
//
// Description:	ATA Controller setup string definitions 
//
//----------------------------------------------------------------------------
//<AMI_FHDR_END>
/=#
#include "VFR.uni"

#string STR_SATA_PCI_SWITCH_FORM              #language eng "SATA/PCIe Switch"
#string STR_SATA_PCI_SWITCH_HELP              #language eng "This Option Is Used For Configuring CPU DXIO to SATA or PCIe Interface"

#string STR_SATA_PCI_SWITCH_CONF_FORM         #language eng "Sata/PCIe Switch Configuration"
#string STR_CPU_SOCKET0_DIE0                  #language eng "Socket0 Die0 Option"
#string STR_CPU_SOCKET0_DIE1                  #language eng "Socket0 Die1 Option"
#string STR_CPU_SOCKET1_DIE0                  #language eng "Socket1 Die0 Option"
#string STR_CPU_SOCKET1_DIE1                  #language eng "Socket1 Die1 Option"

#string STR_CPU_SOCKET0_PORT0                 #language eng "S0 P0[4:7] MSAS J27"
#string STR_CPU_SOCKET0_PORT0_HELP            #language eng "Switch MSAS(J27)'s interface type(Support HP)"

#string STR_PCIE_INTERFACE_TEXT               #language eng "PCIe Interface"
#string STR_SATA_INTERFACE_TEXT               #language eng "SATA Interface"

#string STR_CPU_SOCKET0_PCIE_SLOT0            #language eng "S0 P1[8:15] PCIE J30"
#string STR_CPU_SOCKET0_PCIE_SLOT0_HELP       #language eng "Switch J30 configuration to different type"

#string STR_CPU_SOCKET1_PCIE_SLOT0            #language eng "S1 P1[0:15] PCIE J34"
#string STR_CPU_SOCKET1_PCIE_SLOT0_HELP       #language eng "Switch J34 configuration to different type(Support HP)"

#string STR_PCIE_X16_TEXT                     #language eng "X16"
#string STR_PCIE_X8X8_TEXT                    #language eng "X8_X8"
#string STR_PCIE_X4X4X4X4_TEXT                #language eng "X4_X4_X4_X4"
#string STR_PCIE_X8_TEXT                      #language eng "X8"
#string STR_PCIE_X4X4_TEXT                    #language eng "X4_X4"

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2008, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************